{"data":{"allStrapiJobs":{"nodes":[{"company":"JVA Art Group","date":"Jul 2021 - Oct 2021","position":"Senior Marketing Specialist","desc":[{"id":1,"name":"Developed and maintained updates to JVA Art Group’s website. Provided new website designs based on valid and supporting data points, using industry best-practices to improve website effectiveness, customer experience, usability, and navigation."},{"id":2,"name":"Managed roadmap and strategy for development and release of new content to the website and social media platforms. Manage all JVA backend web properties including hosting, Wordpress CMS, plug-ins, backups, security, and updates to the website."},{"id":3,"name":"Was responsible for developing and maintaining all marketing materials and web presence based on the JVA Art Group brand standards. Marketing materials may include, but not limited to look-books, room mock-ups, social media posts, blog posts, and any new requests that come through as the company grows."}]},{"company":"JVA Art Group","date":"Jun 2017 - Jul 2021","position":"Graphic Designer and Project Manager","desc":[{"id":4,"name":"Created custom art packages based on the direction and inspiration given by each client. Art styles include various color combinations, abstract elements, geometric patterns, textural layers, collages, text overlays, and various layouts that are visually pleasing to the eye. All designs are closely inspected for errors before files are prepped for production."},{"id":5,"name":"I recommend revisions for artwork to ensure a cohesive design for the overall space while respecting the client's design direction and ideas. Each design package big or small includes an organized mood board presentation which shows the clients inspiration, color palette, and furnishings next to each piece of art. This allows the client to visually see how the artwork ties in the space. "}]},{"company":"Naylor Construction","date":"Aug 2013 - May 2017","position":"Marketing Director and Office Specialist","desc":[{"id":6,"name":"Re-structured, re-designed, and maintained the organization’s website."},{"id":7,"name":"Designed all digital and print publications and promotional materials."},{"id":8,"name":"Spearheaded the effort to promote the company through online mediums and social media outlets."},{"id":9,"name":"Assist the senior construction manager with general office duties including tracking and entering invoices, change orders, and employee hours into the company’s accounting software."}]}]}}}